# list = [1, "stroka", 1]
# kortez = (1, "stroka", 3)
# slovar = {1: "one", "st": "two"}
# mnoj = set()

""" 1.Задайте список. Напишите программу, которая определит, присутствует ли в заданном списке строк некое число. """

# number = int(input('Введите число '))
# list = ["qwe", "asd", "zxc", "qwe", 5,"ertqwe"]

# if number in list:
#     print('в списке есть число')
# else:
#     print('числа нет')

""" 2. Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.

*Пример:*

- список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
- список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
- список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
- список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
- список: [], ищем: "123", ответ: -1 """

# list = ["qwe", "asd", "zxc", "qwe", 5, "ertqwe"]
# str = input('Введите строку ')
# count = 0

# for i in range(len(list)):
#     if list[i] == str:
#         count += 1
#         if count == 2:
#             print(i)
#             break
# if count < 2:
#     print('строки нет')