""" 1. Задайте строку из набора чисел. 
Напишите программу, которая покажет большее и меньшее число. 
В качестве символа-разделителя используйте пробел.Без min и max """

# str = input('Введите строку из чисел: ').split(" ")
# print(str)
# max = 0
# m = 100

# for i in str:
#     if int(i) > max:
#         max = int(i)
#     if int(i) < min:
#         min = int(i)
# print(max, min)


""" 2. Найдите корни квадратного уравнения Ax² + Bx + C = 0 
с помощью математических формул нахождения корней квадратного уравнения """


""" 3. Задайте два числа. 
Напишите программу, которая найдёт НОК (наименьшее общее кратное) 
этих двух чисел. """
