
""" Пользователь вводит число, Вам необходимо вывести число Пи с той точностью знаков после запятой, сколько указал пользователь(БЕЗ round()) """


""" Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
N = 6 | N = 12 | 32 | 13 | 9 | 18 | 21
2 * 3 | 2 * 2 * 3 | 2 * 2 * 2 * 2 * 2 | 13 | 3 * 3 | 2 * 3 * 3 | 3*7 """


""" Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.
Ввод:
3 1 2 3
Вывод:
2 1
 """

""" Задана натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100) многочлена и вывести многочлен степени k.

Пример:

- k=2 => 2*x² + 4*x + 5 

k = 6
    ix^6 + ax^5 + bx^4+ cx^3 + dx^2 + ex + h

    a, b, c, d, e, h - рандом """


""" *** 5. Даны два файла, в каждом из которых находится запись многочлена. Задача - сформировать файл, содержащий сумму многочленов.

2*x^  + 4*x      5*x^2 + 2*x
    7x^2 + 6x

2*x^6  + 4*x      5*x^2 + 2*x
    2*x^6 + 5x^2 + 6x """
